#+TITLE: POPL 2025 - Wednesday Sessions
#+DATE: <2025-01-22 Wed>
#+AUTHOR: AYGP System
#+OPTIONS: toc:2 num:nil
#+PROPERTY: header-args :tangle yes :mkdirp t :session 
#+CATEGORY: POPL2025

*** DONE [#C] 13:00-13:20 Derivative-Guided Symbolic Execution
:PROPERTIES:
:SPEAKERS: Yongwei Yuan, Zhe Zhou, Julia Belyakova, Suresh Jagannathan
:AFFILIATION: Purdue University
:END:

#+begin_src elisp
  (defun remove-item (item list)
    "Remove ITEM from LIST."
    (cond
     ((null list) nil)                ; Base case: empty list
     ((equal item (car list)) (cdr list)) ; Found it, return rest of list
     (t (cons (car list) (remove-item item (cdr list))))))
#+end_src

#+RESULTS:
: remove-item

#+begin_src elisp
(let ((my-list '(1 2 3 4 5)))
  (remove-item 3 my-list)) 
#+end_src

#+RESULTS:
| 1 | 2 | 4 | 5 |

#+begin_src ocaml-ts
let rec remove_item item list =
  match list with
  | [] -> [] (* Base case: empty list *)
  | hd :: tl when hd = item -> tl (* Found it, return the rest of the list *)
  | hd :: tl -> hd :: remove_item item tl (* Not found, keep searching *)
#+end_src

